Public Member Functions | Friends | List of all members
ACAPI::UI::Menu::MenuManager Class Reference
Menu integration
A class that contains menu item related functions. More...
#include <MenuManager.hpp>
 Inheritance diagram for ACAPI::UI::Menu::MenuManager:
 Public Member Functions
Result< MenuItem >  | GetMenuItem (const API_MenuItemRef &menuItemRef) const
Get an existing menu item.
Result< void >  | RegisterMenu (short menuStrResID, short promptStrResID, APIMenuCodeID menuPosCode, GSFlags menuFlags) const
Create a new menu.
Result< void >  | InstallMenuHandler (short menuStrResID, APIMenuCommandProc *handlerProc) const
Installs a callback procedure for handling the add-on's menu commands.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Friends
MenuManager  | CreateMenuManager ()
A function to create menu manager instance, that lets you query and manipulate menu related data.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
A class that contains menu item related functions.
Since
Archicad 29
Member Function Documentation
◆ GetMenuItem()
 Result< MenuItem > ACAPI::UI::Menu::MenuManager::GetMenuItem  |  ( |  const API_MenuItemRef & |  menuItemRef | ) |   const
Get an existing menu item.
Returns
The referred menu item object.
Parameters
menuItemRef | The reference to an add-on menu item.
Remarks
This function is used to get the menu item which belongs to the caller API tool add-on.
◆ InstallMenuHandler()
 Result< void > ACAPI::UI::Menu::MenuManager::InstallMenuHandler  |  ( |  short |  menuStrResID,
|  APIMenuCommandProc * |  handlerProc ) const
Installs a callback procedure for handling the add-on's menu commands.
Returns
Result of the callback procedure installation.
Parameters
menuStrResID | An identifier of the menu to install the callback procedure for. This should be the same what you used in the RegisterMenu function.
handlerProc | The callback function to handle the menu commands.
◆ RegisterMenu()
 Result< void > ACAPI::UI::Menu::MenuManager::RegisterMenu  |  ( |  short |  menuStrResID,
|  short |  promptStrResID,
|  APIMenuCodeID |  menuPosCode,
|  GSFlags |  menuFlags ) const
Create a new menu.
Returns
Result of the creation
Parameters
menuStrResID | The resource ID of the menu resource, which should be in the resource fork of the add-on.
promptStrResID | The resource ID of the prompt string resource, which should be in the resource fork of the add-on. These strings appear in the status bar.
menuPosCode | Defines the server application's menu to insert the command into.
menuFlags | Flags describing whether you would like to see any separator item in the menu before or after the registered menu item. Its possible values are: MenuFlag_Default, MenuFlag_SeparatorBefore, and MenuFlag_SeparatorAfter.
Friends And Related Symbol Documentation
◆ CreateMenuManager
 MenuManager CreateMenuManager  |  ( |   | )
friend
A function to create menu manager instance, that lets you query and manipulate menu related data.
Returns
The menu manager instance.